Repository: CodeMOOC/CodyMaze-Bot
Catalog: translation/*/LC_MESSAGES/text.po
Languages: hu_hu, it_it

source: Ok, you’re looking %s!
hu_hu: Rendben, most %s nézel!
it_it: Ok, stai guardando %s!

source: Move back to block <code>%s</code>, face <i>%s</i> and scan the QR Code again.
hu_hu: Menj vissza a <code>%s</code> négyzetre, nézz <i>%s</i> és olvad be a QR kódot újra.
it_it: Torna indietro alla casella <code>%s</code>, girati <i>%s</i> e scansiona nuovamente il QR Code.

source: Please face <i>%s</i>.
hu_hu: Kérlek fordulj <i>%s</i>.
it_it: Prego, girati <i>%s</i>.

source: Very well! You have found the right spot.
hu_hu: Remek! Megtaláltad a megfelelő pontot.
it_it: Molto bene! Hai trovato la casella giusta.

source: <b>%d.</b> Follow these instructions and scan the QR Code at the destination: <code>%s</code>
hu_hu: <b>%d.</b> Kövesse ezeket az utasításokat, és olvassa be a QR-kódot, a rendeltetési helyen: <code>%s</code>
it_it: <b>%d.</b> Segui queste istruzioni e scansiona il QR Code all’arrivo: <code>%s</code>

source: Invalid code.
hu_hu: Érvénytelen kód.
it_it: Codice non valido.

source: Write your full name again, please:
hu_hu: Kérjük, írja be a teljes nevét:
it_it: Scrivi di nuovo il tuo nome completo, per favore:

source: Your progress has been reset. Write /start to start anew or scan in a QR Code.
hu_hu: Haladásod újra indul. Írd be a /start parancsot, hogy újra indulhass vagy skenneld be a QR kódot.
it_it: Il tuo progresso è stato resettato. Scrivi /start per cominciare da capo o scansiona un QR Code sulla scacchiera.

source: Switched language.
hu_hu: Nyelv módosítása.
it_it: Lingua impostata.

source: You completed CodyMaze! If you want to play again, please send the /reset command.
hu_hu: Sikeresen teljesítetted a CodyMaze-t! Ha újra szerettnél játszani, kérjük írd be a /reset parancsot.
it_it: Hai completato CodyMaze! Se intendi giocare di nuovo, invia il comando /reset.

source: You’ve never completed CodyMaze yet, I have no certificate to send you.
hu_hu: Még soha nem fejezted be a CodyMaze-t, nem tudunk tanúsítványt küldeni.
it_it: Non hai mai completato CodyMaze ancora, non ho nessun certificato da inviarti.

source: Didn’t get that. Please scan one of the QR Codes in the maze.
hu_hu: Nem sikerült. Kérjük olvasd be újra valamelyik QR kódot.
it_it: Non ho capito. Prego, scansiona uno dei QR Code della scacchiera.

source: Hmmm, the command you sent is not valid. Try scanning the CodyMaze QR Code again.
hu_hu: A parancs érvénytelen. Próbáld újra skennelni a CodyMaze QR kódját.
it_it: Hmmm, il comando inviato non è valido. Riprova a scansionare il QR Code di CodyMaze.

source: I don’t understand this kind of message!
hu_hu: Nem értem ezt az üzenetet!
it_it: Non capisco questo tipo di messaggi!

source: Completion certificate. Code: %s.
hu_hu: Teljesítési igazolás. Kód: %s.
it_it: Certificato di completamento. Codice: %s.

source: Which language do you speak?
hu_hu: Milyen nyelven beszélsz?
it_it: Che lingua parli?

source: Hello, I am the <b>CodyMaze</b> bot!
hu_hu: Hello, Én vagyk a <b>CodyMaze</b> bot!
it_it: Ciao, sono il bot <b>CodyMaze</b>!

source: Please go to any of the grid’s outer squares and scan the QR Code you find there.
hu_hu: Kérlek menj bármelyik külső négyzetre a rácson és olvasd be a QR kódot amit ott találsz.
it_it: Posizionati lungo il bordo della scacchiera e scansiona uno dei QR Code.

source: Whoops! You should start from any of the grid’s outer squares.
hu_hu: Hoppá! Kezd el bámelyik külső négyzeten a rácsban.
it_it: Ops! Dovresti iniziare da un riquadro lungo il bordo della scacchiera.

source: Very well, you’re at the starting position in <code>%s</code>! Now please turn in order to face <i>%s</i>.
hu_hu: Nagyon jó, a kiindulási ponton vagy <code>%s</code>! Most kérlek fordulj és nézz <i>%s</i> irányba.
it_it: Molto bene, sei al blocco di partenza in <code>%s</code>! Ora girati <i>%s</i>, per favore.

source: Whoops, wrong! Get back to position <code>%s</code>, turn to face <i>%s</i>, and scan the QR Code again.
hu_hu: Hoppá, rossz! Menj vissza a <code>%s</code> pozicióra, fordulj és nézz <i>%s</i> irányba, olvasd be a QR kódot újra.
it_it: Ops, sbagliato! Ritorna al blocco <code>%s</code>, girati <i>%s</i> e scansiona nuovamente il QR Code.

source: Did you get lost? Please reach square <code>%s</code> and face <i>%s</i> to continue!
hu_hu: Talán eltévedtél? Kérlek menj a <code>%s</code> négyzetre majd nézz <i>%s</i> irányba a folytatáshoz!
it_it: Ti sei perso? Raggiungi il blocco <code>%s</code> e girati <i>%s</i> per continuare!

source: Congratulations! You’ve completed <b>CodyMaze</b>!
hu_hu: Gratulálok! Sikeresen teljesítetted a <b>CodyMazet</b>!
it_it: Congratulazioni! Hai completato <b>CodyMaze</b>!

source: Write down your full name for the completion certificate:
hu_hu: Írd be a teljes neved a tanúsítvány eléréséhez:
it_it: Scrivi il tuo nome completo per il certificato di completamento:

source: Thanks for playing!
hu_hu: Köszönöm a játékot!
it_it: Grazie per aver giocato con me!

source: What direction are you facing?
hu_hu: Milyen irányba nézel?
it_it: In che direzione stai guardando?

source: North
hu_hu: Észak
it_it: Nord

source: East
hu_hu: Kelet
it_it: Est

source: South
hu_hu: Dél
it_it: Sud

source: West
hu_hu: Nyugat
it_it: Ovest

source: northwards
hu_hu: észak felé
it_it: verso nord

source: eastwards
hu_hu: kelet felé
it_it: verso est

source: southwards
hu_hu: dél felé
it_it: verso sud

source: westwards
hu_hu: nyugat felé
it_it: verso ovest

source: Your full name is %s. Is this correct?
hu_hu: A teljes neved %s. Helyes?
it_it: Il tuo nome è %s. È corretto?

source: Yes
hu_hu: Igen
it_it: Sì

source: f
it_it: a

source: l
it_it: s

source: r
it_it: d

source: star
hu_hu: csillag
it_it: stella

source: no star
hu_hu: nincs csillag
it_it: non stella

source: if
hu_hu: ha
it_it: se

source: else
hu_hu: különben
it_it: altrimenti

source: path ahead
hu_hu: útvonal előtted
it_it: strada davanti

source: path left
hu_hu: útvonal balra
it_it: strada a sx

source: path right
hu_hu: útvonal jobbra
it_it: strada a dx

source: while
hu_hu: amíg
it_it: finché

source: I am the <b>CodyMaze bot</b> and I will guide you through the game.
hu_hu: Én vagyok a <b>CodyMaze bot</b> és vezetlek a játékon keresztül.
it_it: Sono il <b>bot CodyMaze</b> e ti guiderò attraverso il gioco.

source: The game is composed of <b>13 challenges</b>: for each one, I will send you new instructions that you must follow exactly in order to reach the final destination on the game’s chessboard.
hu_hu: A játék <b>13 kihívásból</b> áll: mindegyikhez küldök neked új utasításokat, amelyeket pontosan követned kell annak érdekében, hogy elérjünk a végső rendeltetési helyre a játék sakktábláján.
it_it: Il gioco è composto da <b>13 sfide</b>: per ognuna di esse ti invierò delle istruzioni, che dovrai seguire alla lettera in modo da raggiungere la tua destinazione finale sulla scacchiera.

source: In order to start playing, please scan the QR Code on one of the outer squares of the chessboard (that is, any square along the first or last row, or the first or last column). You may use any QR Code scanner application to do so.
hu_hu: Annak érdekében, hogy elkezdj játszani, kérjük olvasd le a QR-kódot, az bármelyik négyzetről a sakktábla külsején (ez azt jelenti, hogy bármelyik lehet az első vagy az utolsó sorban, vagy az első vagy az utolsó oszlopban). Használhatja bármely QR-kód olvasó alkalmazást erre.
it_it: Per iniziare a giocare, scansiona uno dei QR Code sul bordo della scacchiera (sarebbe a dire, lungo la prima o ultima riga, oppure lungo la prima o ultima colonna). Puoi utilizzare qualsiasi app per la scansione di QR Code.

source: For further help, check out the <a href="%s">official CodyMaze website</a>.
hu_hu: További segítségért nézd meg a <a href="%s">hivatalos CodyMaze honlapját</a>.
it_it: Per ulteriore aiuto, visita il <a href="%s">sito ufficiale di CodyMaze</a>.

source: The instructions I will send you may contain the following commands: <code>f</code>: move forward, <code>l</code>: turn left, <code>r</code>: turn right, and other commands such as <code>if</code>, <code>else</code>, and <code>while</code>. Code blocks are indicated in <code>{}</code> and can be repeated. For instance, <code>2{fr}</code> tells you to move forward and turn right twice.
hu_hu: Az utasításokat, amiket küldök neked a következő parancsokat tartalmazhatja: <code>f</code>: előrelépni, <code>l</code>: fordulj balra, <code>r</code>: forduljon jobbra, és más parancsokat, mint <code>ha</code>, <code>különben</code>, és <code>amíg</code>. A kód blokkok<code>{}</code>-ben szerepelnek, és ismétlődhetnek. Például <code>2{fr}</code> utasít, hogy lépj előre, és jobbra kétszer.
it_it: Le istruzioni che ti invierò potranno contenere i seguenti comandi: <code>a</code>: avanza di una casella, <code>s</code>: gira a sinistra, <code>d</code>: gira a destra, e altri comandi come <code>se</code>, <code>altrimenti</code> e <code>finché</code>. Blocchi di codice sono indicati da <code>{}</code> e possono essere ripetuti. Ad esempio, <code>2{fr}</code> significa che dovrai avanzare e girare a destra due volte di seguito.

source: No
hu_hu: Nem
