Repository: CodeMOOC/CodyMaze-Bot
Catalog: src/translation/*/LC_MESSAGES/text.po
Languages: sr_rs

source: Ok, you’re looking %s!
sr_rs: U redu, gledate %s!

source: Move back to block <code>%s</code>, face <i>%s</i> and scan the QR Code again.
sr_rs: Vrati se na blok <code>%s</code>, gledaj prema <i>%s</i> i skeniraj QR kod ponovo.

source: Please face <i>%s</i>.
sr_rs: Okrenite se prema <i>%s</i>.

source: Very well! You have found the right spot.
sr_rs: Veoma dobro! Našli ste pravo mesto.

source: <b>%d.</b> Follow these instructions and scan the QR Code at the destination: <code>%s</code>
sr_rs: <b>%d.</b> Slijedite ove upute i Skenirajte QR kod na odredištu: <code>%s</code>

source: Invalid code.
sr_rs: Neispravan kod.

source: Write your full name again, please:
sr_rs: Napiši svoje puno ime ponovo:

source: Your progress has been reset. Write /start to start anew or scan in a QR Code.
sr_rs: Tvoj napredak je poništena. Piši /Start za početak iznova ili skenirajte QR kod.

source: Switched language.
sr_rs: Promeni jezik.

source: You completed CodyMaze! If you want to play again, please send the /reset command.
sr_rs: Završio si CodyMaze! Ako želite da igrate ponovo, molim vas pošaljite komandu "/reset".

source: You’ve never completed CodyMaze yet, I have no certificate to send you.
sr_rs: Nikad niste pre dovršili CodyMaze, nemamo sertifikat da vam pošaljemo.

source: Didn’t get that. Please scan one of the QR Codes in the maze.
sr_rs: Nisam razumeo. Molim te, Skeniraj jedan od QR kodova u lavirintu.

source: Hmmm, the command you sent is not valid. Try scanning the CodyMaze QR Code again.
sr_rs: Hmmm, komanda koju ste poslali nije važeća. Pokušajte ponovo da skenirate QR kod CodyMaze.

source: I don’t understand this kind of message!
sr_rs: Ne razumem ovu vrstu poruke!

source: Completion certificate. Code: %s.
sr_rs: Završetak sertifikata. Šifra: %s.

source: Which language do you speak?
sr_rs: Koji jezik govorite?

source: Hello, I am the <b>CodyMaze</b> bot!
sr_rs: Zdravo, ja sam na <b>CodyMaze</b> bot!

source: Please go to any of the grid’s outer squares and scan the QR Code you find there.
sr_rs: Idite na neki spoljni kvadrata na mreži i skenirajte QR kod koji se tamo nalazi.

source: Whoops! You should start from any of the grid’s outer squares.
sr_rs: Whoops! Trebalo bi da počneš sa bilo kojeg spoljnog kvadrata na mreži.

source: Very well, you’re at the starting position in <code>%s</code>! Now please turn in order to face <i>%s</i>.
sr_rs: Odlično, sada si na početnoj poziciji na <code>%s</code>! Sada se okleni da bi gledao prema <i>%s</i>.

source: Whoops, wrong! Get back to position <code>%s</code>, turn to face <i>%s</i>, and scan the QR Code again.
sr_rs: Ups, nije u redu! Nazad na poziciju <code>%s</code>, gledaj prema <i>%s</i>, i ponovo skenirajte QR kod.

source: Did you get lost? Please reach square <code>%s</code> and face <i>%s</i> to continue!
sr_rs: Da li ste se izgubili? Idite do kvadrata <code>%s</code> i gledajte prema <i>%s</i> da nastavite!

source: Congratulations! You’ve completed <b>CodyMaze</b>!
sr_rs: Čestitam! Uspešno si završio <b>CodyMaze</b>!

source: Write down your full name for the completion certificate:
sr_rs: Zapišite svoje puno ime za završetak sertifikat:

source: Thanks for playing!
sr_rs: Hvala na igri!

source: What direction are you facing?
sr_rs: U kom pravcu ste okrenuti?

source: North
sr_rs: Sever

source: East
sr_rs: Istok

source: South
sr_rs: Jug

source: West
sr_rs: Zapad

source: northwards
sr_rs: prema severu

source: eastwards
sr_rs: prema istoku

source: southwards
sr_rs: prema jugu

source: westwards
sr_rs: prema zapadu

source: Your full name is %s. Is this correct?
sr_rs: Tvoje puno ime je %s. Da li je to ispravno?

source: Yes
sr_rs: Da

source: No
sr_rs: Ne

source: star
sr_rs: zvezda

source: no star
sr_rs: nema zvezda

source: if
sr_rs: ako

source: else
sr_rs: drugo

source: path ahead
sr_rs: put prema napred

source: path left
sr_rs: put prema levo

source: path right
sr_rs: put prema desno

source: while
sr_rs: dok je

source: I am the <b>CodyMaze bot</b> and I will guide you through the game.
sr_rs: Ja sam <b>CodyMaze bot</b> i ja ću te voditi kroz igru.

source: The game is composed of <b>13 challenges</b>: for each one, I will send you new instructions that you must follow exactly in order to reach the final destination on the game’s chessboard.
sr_rs: Igra se sastoji od <b>13 izazova</b>: za svaki od njih ću vam poslati nove instrukcije, morate pratiti tačno kako bi došli do konačnog odredišta na tabli.

source: In order to start playing, please scan the QR Code on one of the outer squares of the chessboard (that is, any square along the first or last row, or the first or last column). You may use any QR Code scanner application to do so.
sr_rs: Da biste počeli sa igrom, molim vas, skenirajte QR kod na jednoj od spoljnih kvadrata table (to jest, bilo koji kvadrat u prvom ili zadnjem redu ili prvoj ili zadnjoj koloni). Možete koristiti bilo koju aplikaciju za skeniranje QR koda da biste to učinili.

source: For further help, check out the <a href="%s">official CodyMaze website</a>.
sr_rs: Za dalju pomoć, vidi <a href="%s">zvanični sajt CodyMaze</a>.

source: The instructions I will send you may contain the following commands: <code>f</code>: move forward, <code>l</code>: turn left, <code>r</code>: turn right, and other commands such as <code>if</code>, <code>else</code>, and <code>while</code>. Code blocks are indicated in <code>{}</code> and can be repeated. For instance, <code>2{fr}</code> tells you to move forward and turn right twice.
sr_rs: Poslaću vam uputstva koja mogu da sadrže sledeće komande: <code>f</code>: kreni napred, <code>l</code>: skreni levo, <code>r</code>: skreni desno, kao i ostale komande poput <code>ako</code>, <code>drugo</code> i <code>dok</code>. Šifra blokova su naznačena u <code>{}</code> i mogu se ponavljati. Na primer, <code>2{fr}</code> govori da ideš napred i skrenite desno dva puta.
